[
  {
    "slug": "authentic-taco-fusion-columbus",
    "date": "February 2026",
    "title": "Authentic Tacos Meet Tex-Mex Fusion in Columbus",
    "excerpt": "At Taco and Grill, we mix classic taco flavor with tex-mex fusion and fast-food convenience for a menu that works for every craving.",
    "author": "Taco and Grill Team",
    "readTime": "4 min read",
    "coverEmoji": "🌮",
    "content": [
      "Taco and Grill was built around one goal: serve flavorful tacos and fast favorites without long waits. Our menu is rooted in authentic taco style and expanded with tex-mex inspired options for guests who want variety.",
      "From birria and supreme tacos to quesadillas, burritos, and loaded tortas, we focus on balanced flavor and fresh prep. Every order is made quickly, but we still keep quality and consistency at the center.",
      "If you are nearby in Columbus and want a reliable taco and fast-food spot, Taco and Grill is ready for your next pickup order."
    ]
  },
  {
    "slug": "halal-quality-at-taco-and-grill",
    "date": "January 2026",
    "title": "How We Keep Halal Quality at Taco and Grill",
    "excerpt": "We stay focused on halal-friendly quality and kitchen consistency so guests can order with confidence every time.",
    "author": "Kitchen Team",
    "readTime": "3 min read",
    "coverEmoji": "✅",
    "content": [
      "Our kitchen operations are designed around consistency and halal-focused preparation standards. We know trust matters as much as taste, and we keep both in focus every day.",
      "The menu includes tacos, burritos, tortas, quesadillas, sides, and drinks with options that fit quick lunches, dinner plans, and late-night cravings.",
      "Guests can call in orders directly or use Clover online ordering for convenience. Our team works to make every order accurate, fast, and full of flavor."
    ]
  },
  {
    "slug": "late-night-taco-fastfood-columbus",
    "date": "December 2025",
    "title": "Late-Night Taco and Fast-Food Flavor in Columbus",
    "excerpt": "Open daily from 3 PM to 12 AM, Taco and Grill is here when you need satisfying food later in the day.",
    "author": "Taco and Grill Team",
    "readTime": "3 min read",
    "coverEmoji": "🌙",
    "content": [
      "Late evenings can be the toughest time to find quality food that is both fast and flavorful. Taco and Grill fills that gap with a menu designed for speed and satisfaction.",
      "Whether you are picking up tacos for yourself or ordering family items for a group, we keep things simple: clear menu choices, fast prep, and dependable service.",
      "Call us for pickup or place your order through Clover. Either way, our kitchen is ready through midnight every day."
    ]
  }
]